OdDbBaseDatabasePE.createMaterial(OdDbStub**!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdRxObject*,OdRxObject*,OdGiMaterialTraits!System.Runtime.CompilerServices.IsConst*,OdGiMapper!System.Runtime.CompilerServices.IsConst*,OdCmEntityColor!System.Runtime.CompilerServices.IsConst*)
\details
Create new material.
\param material        [out] A pointer to a new created material.
\param pSourceDb       [in]  A pointer to a source database object.
\param pDestinationDb  [in]  A pointer to a destination database object.
\param pMaterialTraits [in]  A pointer to a material info.
\param pMaterialMapper [in]  A pointer to a material mapper.
\param pMaterialColor  [in]  A pointer to a material color.

OdDbBaseDatabasePE.zoomToExtents(OdGsDCRect!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGsDevice*,OdRxObject*,OdGeBoundBlock3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.UInt32!System.Runtime.CompilerServices.IsLong,OdDbStub*)
\details
Makes the specified Gs device render the current layout zoomed to extents.
\param outputRect   [out] A rectangle, which determines the printable area in device units.
\param pDevice      [in]  A pointer to a device to render the current layout with.
\param db           [in]  A pointer to a drawing database.
\param plotExtents  [out] Eye coordinate system plotting extents of the device viewport.
\param extentsFlags [in]  Extents flags.
\param objectId     [in]  Object identifier.
\remarks
If no viewport is found, the method throws an exception.